import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-about',
  templateUrl: './about.component.html',
  styleUrls: ['./about.component.scss'],
})
export class AboutComponent implements OnInit {
  constructor() {}

  public textForModel!: string;
  public language!: string;

  ngOnInit(): void {}
  clickBox(index: number, language: string): void {
    const myModal = document.getElementById('myModal') as HTMLElement;
    this.textForModel = this.Wiki[index][language];
    this.language = language;
    myModal.addEventListener('shown.bs.modal', () => {});
  }

  public Wiki: any[] = [
    {
      html: `HTML (ראשי תיבות באנגלית: Hyper Text Markup Language; בעברית: שְׂפַת סִימָנֵי עֲרִיכָה לְתַמְלִיל-עָל) שפת תגיות לתצוגה ועיצוב דפי אינטרנט ותוכן לתצוגה בדפדפן. זו שפת התגיות המרכזית בעולם האינטרנט, המהווה שלד למרבית עמודי התוכן באינטרנט. השפה מאפשרת עיצוב תוכן בצורה מהירה, קלה ללימוד באופן יחסי וקלה לכתיבה.
      HTML תוכננה לעבוד על כל מחשב, מכל סוג והיא סלחנית מאוד לגבי פרטים קטנים. היא מותרת לשימוש על ידי כל מפתח אתרים, ללא צורך ברכישת זכויות יוצרים מחברה כלשהי, והיא ניתנת לקריאה בכל סוגי המערכות. HTML מאפשרת ליצור קישורים למסמכי HTML נוספים או לסוגים שונים של נתונים. כמו כן, היא תומכת במולטימדיה, היא מאפשרת להציג נתונים בעזרת: טקסט, צליל, תמונה, וידאו ועוד. HTML משמשת תקן ברשת האינטרנט וכלליה מוגדרים על ידי ארגון תקינה בינלאומי, W3C. הגירסה הנוכחית של השפה היא HTML5.
      HTML גם מאפשר הטמעה של תסריטים בדף, למשל JavaScript, ובכך להשפיע על התנהגות הדף במצבים שונים, שילוב שפת תכנות זו מאפשרת יצירת אינטראקטיביות בין האתר למשתמש בו.
      קובצי HTML נשמרים בסיומות ".htm" ו-".html".`,
    },
    {
      css: `גיליונות סגנון מדורגים (באנגלית: Cascading Style Sheets ובראשי תיבות: CSS) הם פורמט לעיצוב דפי אינטרנט. הגיליונות קובעים את עיצובם של תגים ב-HTML, XHTML וכל שפה דומה ל-XML לבניית אתרי אינטרנט.

    CSS נוצר במטרה להפריד בין תוכן ומבנה דפי האינטרנט לבין עיצובם: עד ליצירת ה-CSS בידי קבוצת התקינה W3C ב-1995, נכתבו תוכן האתרים וסגנון העיצוב שלהם באותו דף HTML. כתוצאה מכך, הפך קוד ה-HTML למסובך ובלתי קריא, ושינויים עיצוביים באתר שלם דרשו מעבר דף אחר דף. באמצעות CSS ניתן למקם הגדרות עיצוב בקובץ יחיד, ששינוי בו ישתקף בבת אחת בכל הדפים העושים בו שימוש.
    
    גליונות הסגנון נקראים "מדורגים" (באנגלית: Cascading) משום שיש להם היררכיה: למשל, אם יש הגדרות שונות עבור אותו אלמנט בדף, הגדרות CSS הנמצאות בבלוק <style> בחלק ה-<head> של דף ה-HTML גוברות על הגדרות מקבילות הנמצאות בקובץ CSS חיצוני (בתנאי שהם הוגדרו לאחר התגית <link> שמייבאת את הקובץ החיצוני), והגדרות CSS הנמצאות בתוך תגית בדף (כערך של התכונה style) גוברות על הגדרות בבלוק <style>.`,
    },
    {
      javascript: `JavaScript (בעברית: ג'אווה סקריפט) היא שפת תכנות דינמית כללית מונחית־עצמים המותאמת לשילוב באתרי אינטרנט ורצה על ידי הדפדפן בצד הלקוח. כיום השפה יכולה לרוץ באופן עצמאי כמו שפות אחרות בעזרת סביבות הרצה כמו Node.js. השפה מרחיבה את יכולות שפת התגיות הבסיסית HTML ומאפשרת בכך ליצור יישומי אינטרנט מתוחכמים יותר. למעשה, רוב אתרי האינטרנט המודרניים משלבים שפה זו. היא ידועה בעיקר כשפה המוטבעת בדפי HTML על מנת להציג דפי רשת דינמיים שמשולבת בהם תוכנה. קוד ה־JavaScript שמשולב בדף HTML מבוצע על ידי הדפדפן. JavaScript נוחה מאוד לעבודה עם DOM ולתפעול DHTML. 

    על בסיס סביבת הריצה של הדפדפנים, נבנו סביבות ריצה מקומיות להרצה של ג'אווה סקריפט במחשבים אישיים ובשרתים (Node.js, Deno.js).`,
    },
    {
      angular: `Angular היא תשתית תוכנה (framework) בקוד פתוח ליישומי רשת המבוססת על שפת התכנות TypeScript, המתוחזקת על ידי גוגל ועל ידי קהילה רחבה של מפתחים. התשתית מיועדת לפתרון אתגרים בפיתוח יישומי דף-יחיד , ופישוט הפיתוח והבדיקות של יישומים אלו, באמצעות תשתית תוכנה לארכיטקטורות צד לקוח כמו MVC או MVVM, יחד עם רכיבים בהם משתמשים בדרך כלל ביישומי אינטרנט עשירים.`,
    },
    {
      react: `React (לעיתים נכתבת כ-React.js או ReactJS) היא ספריית קוד פתוח בשפת ג'אווה סקריפט המשמשת לפיתוח ממשק משתמש.

    React פותחה על ידי ג'ורדן וולקה, מפתח תוכנה בחברת פייסבוק (מטא). הוא הושפע מ-AngularJS ו-XHP, שהייתה ספריית PHP לניהול רכיבי HTML. הספרייה הושמשה לראשונה בדף הבית של פייסבוק בשנת 2011 ובהמשך באינסטגרם ב-2012. הספרייה שוחררה כקוד פתוח במאי 2013. בתחילת 2015 פרסמה פייסבוק ספרייה נוספת בשם ריאקט נייטיב המאפשרת פיתוח ממשקי משתמש ל-iOS, אנדרואיד ול-Microsoft Windows (UWP). ספרייה זו מתחרה בפלטפורמות לבניית אפליקציות היברידיות כגון אפאצ'י קורדובה.
    
    אחת התכונות המרכזיות של React היא השימוש ב-Virtual Document Object Model או Virtual DOM. הספרייה יוצרת מבנה נתונים בזיכרון, מחשבת את השינויים הנדרשים ובכך מעדכנת את ה-DOM ביעילות.
    
    בעזרת טרנס-קומפיילר (כמו Babel.js) רכיבי React יכולים להכתב בשפת JSX, הרחבה של ג'אווה סקריפט המאפשרת תגיות HTML בתוך הקוד. במהלך הטרנספילציה, תגיות ה-HTML מתרגמות לקריאות לפונקציות ג'אווה סקריפט של React ומעדכנות את ה-Virtual DOM לפי הצורך.
    
    Next.js היא ספריית React המאפשרת מספר תכונות נוספות, כולל עיבוד בצד השרת ויצירת אתרים סטטיים.`,
    },
    {
      vue: `Vue.js כולל ארכיטקטורה הניתנת להתאמה הדרגתית המתמקדת בעיבוד הצהרתי והרכב רכיבים. ספריית הליבה מתמקדת בשכבת התצוגה בלבד.  תכונות מתקדמות הנדרשות ליישומים מורכבים כגון ניתוב , ניהול מצב וכלי בנייה מוצעים באמצעות ספריות וחבילות תומכות שמתוחזקים באופן רשמי. 

    Vue.js מאפשר הרחבת HTML עם תכונות HTML הנקראות הנחיות. ההנחיות מציעות פונקציונליות ליישומי HTML , ומגיעות כהנחיות מובנות או בהגדרת משתמש.`,
    },
    {
      node: `Node.js היא סביבת ריצה (אנ') לשפת JavaScript שנכתבה ב-C++ ומבוססת על מנוע V8. היא תוכננה לכתיבת אפליקציות רשת סקיילאביליות כגון שרתי HTTP.
    Node.js מאפשרת לקוד JavaScript לרוץ ללא צורך בדפדפן, מה שמאפשר לה לשמש כשפת צד שרת. הגרסה הראשונה של התוכנה פותחה בשנת 2009.
    קהילת המפתחים של Node.js התפצלה בשלהי שנת 2014 בשל חילוקי דעות על עתיד המערכת עם חברת Joyent שתחזקה את התוכנה, כאשר המפתחים הפורשים הקימו את מערכת io.js אך התמזגו חזרה במאי 2015.`,
    },
    {
      express: `Express.js היא ספריית קוד פתוח מבוססת MVC, שנוצרה עבור Node.js. Express נוצרה תחת רישיון MIT, והיא מתוחזקת על ידי הקהילה.
    Express נחשבת לחלק ממקבץ התוכנות MEAN, כחלק מצד השרת.`,
    },
  ];
}
